<template>
    <div class="bg-gray-200 flex mx-auto" id="about">
        <div class=" mt-12 flex  flex-col xl:flex-row w-11/12 container-md mx-auto justify-around">
            <div class="xl:w-1/2">
                <h2 class="text-start text-3xl">О нас</h2>
                <hr class="w-32  h-1 my-2  bg-amber-500 border-0 rounded-sm  ">
                <p class="text-justify  text-xl  xl:text-2xl  mt-5 pb-12">Но понимание сути ресурсосберегающих технологий напрямую зависит
                    от системы обучения кадров, соответствующей насущным потребностям. Но постоянное информационно-пропагандистское обеспечение
                    нашей деятельности позволяет выполнить важные задания по разработке приоретизации разума над
                    эмоциями.Современные технологии достигли такого уровня, что реализация намеченных плановых заданий
                    не даёт нам иного выбора, кроме определения новых предложений. Банальные, но неопровержимые выводы, а также
                    стремящиеся вытеснить традиционное производство, нанотехнологии, превозмогая сложившуюся непростую
                    экономическую ситуацию, рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.
                    В своём стремлении улучшить пользовательский опыт мы упускаем, что явные признаки победы институционализации
                    лишь добавляют фракционных разногласий и своевременно верифицированы.
                    Противоположная точка зрения подразумевает, что некоторые особенности внутренней политики являются
                    только методом политического участия и разоблачены. А ещё базовые сценарии поведения пользователей
                    формируют глобальную экономическую сеть и при этом — призваны к ответу. 
                </p>
            </div>
            <div class="mt-20 hidden xl:block">
                <img src="../public/images/photo_2.jpg" alt="">
            </div>
        </div>
    </div>
</template>
