<template>
    <div class=" w-4/5  mx-auto pt-12 ">
        <h2 class="text-start  -ms-2 text-3xl">Частые вопросы о пиломатериалах</h2>
        <hr class="w-48 h-1 my-2  -ms-2   bg-amber-500 border-0 rounded-sm">
        <div class="card">
            <Accordion value="0">
                <AccordionPanel value="0">
                    <AccordionHeader class="text-2xl">Как выбрать подходящие пиломатериалы для строительства?
                    </AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl ">
                            При выборе пиломатериалов важно учитывать несколько факторов:
                            Тип проекта: Определите, для каких целей будут использоваться материалы (например, для
                            каркасного строительства, отделки или мебели).
                            Порода древесины: Разные породы имеют разные характеристики. Например, сосна более доступна
                            и легка в обработке, в то время как дуб более прочный и долговечный.
                            Условия эксплуатации: Если материалы будут использоваться на улице или в условиях повышенной
                            влажности, выбирайте устойчивые к влаге и гниению варианты (например, обработанную древесину
                            или композитные материалы).
                            Экологические требования: Убедитесь, что выбранные материалы соответствуют экологическим
                            стандартам и имеют необходимые сертификаты.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="1">
                    <AccordionHeader class="text-2xl">Как правильно хранить пиломатериалы?</AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            Правильное хранение пиломатериалов критически важно для предотвращения их повреждения:
                            Сухое место: Деревянные материалы следует хранить в сухом помещении, защищенном от влаги.
                            Влага может привести к гниению и деформации.
                            Поднятие от земли: Храните пиломатериалы на поддонах или других подъемных конструкциях,
                            чтобы избежать контакта с землей и предотвратить впитывание влаги.
                            Проветривание: Обеспечьте хорошую вентиляцию вокруг хранимых материалов, чтобы избежать
                            накопления влаги и образования плесени.
                            Защита от солнечного света: Если возможно, избегайте длительного воздействия прямых
                            солнечных лучей на древесину, так как это может привести к выцветанию и растрескиванию.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="2">
                    <AccordionHeader class="text-2xl">Как обрабатывать пиломатериалы перед использованием?
                    </AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            Обработка пиломатериалов перед использованием включает несколько этапов:
                            Обрезка: При необходимости обрежьте материалы до нужных размеров с помощью пилы.
                            Шлифовка: Используйте шлифовальную машину или наждачную бумагу для сглаживания поверхности и
                            удаления заусенцев.
                            Обработка защитными средствами: Нанесите антисептики или другие защитные составы для
                            увеличения долговечности древесины и защиты от вредителей и гнили.
                            Покраска или лакировка: Если требуется эстетическая отделка, нанесите краску или лак после
                            завершения обработки. Это не только улучшит внешний вид, но и создаст дополнительный
                            защитный слой.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="3">
                    <AccordionHeader class="text-2xl">Какой уровень влажности пиломатериалов считается оптимальным для
                        строительства?</AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            Оптимальный уровень влажности для пиломатериалов, используемых в строительстве, составляет
                            8-12%. При слишком высокой влажности древесина может деформироваться и гнить, а при слишком
                            низкой — трескаться. Поэтому важно проверять влажность перед использованием.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="4">
                    <AccordionHeader class="text-2xl">Что такое термообработка древесины и какие у нее преимущества?
                    </AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            Термообработка — это процесс нагрева древесины до высоких температур без доступа кислорода.
                            Это улучшает ее устойчивость к влаге и вредителям, а также уменьшает вероятность деформации.
                            Обработанная таким образом древесина имеет привлекательный цвет и текстуру.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="5">
                    <AccordionHeader class="text-2xl">Как выбрать пиломатериалы для строительства дома, чтобы обеспечить
                        долговечность и надежность конструкции?
                    </AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            При выборе пиломатериалов для строительства дома важно учитывать такие факторы, как тип
                            древесины, ее сорт, уровень влажности и наличие защитных обработок. Рекомендуется выбирать
                            материалы с высокой прочностью и устойчивостью к внешним воздействиям. Также стоит обратить
                            внимание на экологические сертификаты, чтобы гарантировать безопасность для здоровья.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
                <AccordionPanel value="6">
                    <AccordionHeader class="text-2xl">Какие преимущества использования древесных материалов в сравнении
                        с другими строительными материалами?
                    </AccordionHeader>
                    <AccordionContent>
                        <p class="m-0 text-xl">
                            Древесные материалы обладают множеством преимуществ: они легкие, прочные и имеют отличные
                            теплоизоляционные свойства. Кроме того, древесина является экологически чистым материалом,
                            который легко перерабатывается. Использование древесины в строительстве также позволяет
                            создать уютную атмосферу и эстетически привлекательный интерьер.
                        </p>
                    </AccordionContent>
                </AccordionPanel>
            </Accordion>
        </div>
    </div>
</template>

<script setup>
import { useCounterStore } from '~/stores/store'
const store = useCounterStore()
</script>